espressif/esp-rainmaker-neo-firmware/examples/common/ci-sdkconfig/sdkconfig.ci.psram_octal
# CI-only: exercise the S3 octal-PSRAM path (WROOM-1 N8R8 / DevKitC-1 class modules).
# Opt-in profile, S3 only. Generic S3 builds leave PSRAM disabled.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_MALLOC=y
